{
    "bar": "Represents categorical data with rectangular bars. Bar lengths are proportional to the values they represent. Can be vertical or horizontal. Used for comparisons across categories.",
    "barpolar": "Visualizes data using bars on a polar coordinate system (circular). Useful for cyclical data or directional data, where bar lengths represent magnitudes at given angles.",
    "box": "Displays the distribution of numerical data through quartiles. Shows median, interquartile range (IQR), whiskers (typically 1.5x IQR), and outliers. Useful for comparing distributions.",
    "candlestick": "A financial chart used to describe price movements of a security, derivative, or currency. Displays the open, high, low, and close (OHLC) prices for a specific period.",
    "carpet": "Creates a 2D plot where data points are mapped onto a non-rectangular, curvilinear grid (the 'carpet'). Often used in engineering to visualize interactions between multiple variables.",
    "choropleth": "A thematic map where areas are shaded or patterned in proportion to a statistical variable. Used to represent data for geographic regions like countries or states.",
    "choroplethmap": "This is likely referring to `go.Choropleth` or `go.Choroplethmapbox`. Plotly has `go.Choropleth` for use with `geo` subplots and `go.Choroplethmapbox` for tile-based maps via Mapbox. Both display geographical areas shaded according to a data variable.",
    "choroplethmapbox": "Draws geographically-bound regions, colored according to a data scale, on a Mapbox tile layer. Requires GeoJSON data for region boundaries.",
    "cone": "Visualizes 3D vector fields using cones. The direction of each cone indicates the vector direction, and its size/color can represent magnitude.",
    "contour": "Displays 2D data with contour lines representing constant values (isolines). Similar to a topographical map, showing areas of equal value in a 2D dataset.",
    "contourcarpet": "Draws contour lines on a carpet plot. This allows visualization of a third dimension (isolines) over the curvilinear grid of the carpet plot.",
    "densitymap": "This term often refers to a `density_heatmap` (available in Plotly Express) or a 2D histogram (`histogram2d`) which shows the density of data points in a 2D space. `densitymapbox` is a specific trace for geographic density.",
    "densitymapbox": "Visualizes the density of points on a Mapbox tile layer. Useful for showing hotspots or concentrations of data points in a geographic area.",
    "funnel": "Represents stages in a process, typically showing progressive reduction. Each stage is usually a bar, and its width/height represents the quantity. Commonly used in sales/marketing.",
    "funnelarea": "Similar to a funnel chart, but uses areas to represent values at different stages of a process. Often used to show part-to-whole relationships through connected trapezoids.",
    "heatmap": "Represents 2D data where values are depicted by color. Useful for showing the magnitude of a phenomenon as color in two dimensions.",
    "histogram": "Represents the distribution of a single numerical variable by dividing the data into bins and showing the frequency of observations in each bin as bars.",
    "histogram2d": "Visualizes the joint distribution of two numerical variables. The 2D space is divided into rectangular bins, and the number of data points in each bin is represented by color or height.",
    "histogram2dcontour": "Similar to a 2D histogram, but represents the density of points using contour lines instead of colored bins. Shows regions of similar data point concentration.",
    "icicle": "A hierarchical chart that visualizes tree-like data structures. Each node is represented by a rectangle, with child nodes displayed below their parent. Width/color can represent values.",
    "image": "Displays an image within a plot. Can be used for annotations, backgrounds, or as the primary data representation if the data is inherently an image.",
    "indicator": "Displays a single value or a comparison of a value against a target. Often used in dashboards to show key performance indicators (KPIs), gauges, or bullet charts.",
    "isosurface": "Renders 3D surfaces representing points of constant value (isosurfaces) within a 3D volumetric dataset. Used for visualizing scalar fields in 3D.",
    "mesh3d": "Creates 3D surfaces from a set of vertices and faces (triangles or quadrilaterals). Used for plotting complex 3D geometries or surfaces defined by a mesh.",
    "ohlc": "Open-High-Low-Close chart, similar to a candlestick chart. Used in finance to represent price movements over time, typically with vertical lines and small horizontal ticks for open and close.",
    "parcats": "Parallel Categories plot. Visualizes multi-dimensional categorical data, showing the flow and frequency of categories across different dimensions.",
    "parcoords": "Parallel Coordinates plot. Visualizes multi-dimensional numerical data. Each dimension is represented by a vertical axis, and each data point is a line connecting its values across these axes.",
    "pie": "A circular statistical graphic divided into slices to illustrate numerical proportion. Each slice's arc length (and thus its central angle and area) is proportional to the quantity it represents.",
    "sankey": "Visualizes flow between nodes in a network. The width of the connecting lines (links) is proportional to the flow quantity. Useful for showing energy, material, or cost transfers.",
    "scatter": "Displays values for two variables as a collection of points. Can also be used to draw lines, markers, or text. Fundamental for showing relationships between variables.",
    "scatter3d": "Displays data points in a 3D Cartesian coordinate system. Each point is defined by x, y, and z coordinates. Can include lines and markers.",
    "scattercarpet": "Draws scatter points or lines on a carpet plot's curvilinear coordinate system. Used to overlay specific data points onto the carpet grid.",
    "scattergeo": "Displays geographic data as scatter points (or lines, or bubble markers) on a map. Uses various map projections and can include country/region outlines.",
    "scattergl": "A WebGL-accelerated version of the scatter plot, designed for high-performance rendering of very large datasets (hundreds of thousands to millions of points).",
    "scattermap": "This is a general term. Plotly provides specific trace types like `scattergeo` for geographic maps and `scattermapbox` for tile-based maps from Mapbox. Both are used to plot points on maps.",
    "scattermapbox": "Draws scatter points, lines, or bubble markers on a Mapbox tile layer. Useful for detailed, interactive geographic visualizations with high point counts.",
    "scatterpolar": "Displays data points in a polar coordinate system using radial (r) and angular (theta) coordinates. Can also draw lines and markers.",
    "scatterpolargl": "A WebGL-accelerated version of the scatterpolar plot, for high-performance rendering of large datasets in polar coordinates.",
    "scattersmith": "Displays data on a Smith chart, which is used in electrical engineering for visualizing impedance, admittance, and reflection coefficients.",
    "scatterternary": "Displays data points in a ternary (triangular) coordinate system. Used for datasets where three components sum to a constant (e.g., compositions).",
    "splom": "Scatter Plot Matrix. Creates a matrix of scatter plots, showing pairwise relationships between multiple variables in a dataset. Diagonals can show histograms or density plots.",
    "streamtube": "Visualizes 3D vector fields using tubes whose direction and thickness represent the vector flow. Shows the trajectory and magnitude of flow lines.",
    "sunburst": "A hierarchical chart that visualizes tree-like data using concentric circles. Each level of the hierarchy is a ring, with segments representing nodes. Area/color can represent values.",
    "surface": "Creates a 3D surface plot from a 2D grid of z-values (heights) defined over x and y coordinates. Useful for visualizing functions of two variables or 3D topographies.",
    "table": "Displays data in a tabular format with rows and columns. Can include headers, cell styling, and interactive features.",
    "treemap": "Visualizes hierarchical data using nested rectangles. The area of each rectangle is proportional to its value. Good for showing part-to-whole relationships within a hierarchy.",
    "violin": "A combination of a box plot and a kernel density plot. Displays the distribution of numerical data, showing its probability density, median, and interquartile range.",
    "volume": "Renders 3D volumetric data, often by ray casting or slicing. Used to visualize scalar fields in 3D, showing internal structures or density variations.",
    "waterfall": "Visualizes the cumulative effect of sequentially introduced positive or negative values. Shows how an initial value is affected by a series of intermediate changes."
}